# файл создаётся для управления docker-контейнером

# базовый образ с node.js
FROM node:18

# обычное место для одного приложения в контейнере
# контейнер содержит почти полноценный linux
WORKDIR /usr/src/app

# копирует наше приложение внутрь контейнера
# первая точка здесь означает, что файлы берутся из базовой директории этого файла
# вторая точка обозначает, что файлы копируются в директорию указанную в WORKDIR
COPY . .

# устанавливаем зависимости в контейнер
# выполняется в момент сборки контейнера
RUN npm i

# открываем порт наружу, чтобы получить доступ по сети, потому что по умолчанию к контейнеру нельзя получить доступа
EXPOSE 3000

# задаётся команда, которая выполняется при старте приложения
# выполняется в момент старта контейнера
CMD ["npm", "start"]

# необходимо создать файл dockerignore, чтобы как минимум поместить туда node_modules

# Сборка контейнера осуществляется командой в консоли:
# docker build -t notes_app .
# где -t notes_app - добавление тега к контейнеру, чтобы обращаться к нему по этому тегу
# . - обозначает, где нужно искать Dockerfile, а именно в текущей директории
#
# Приложение запускается командой в консоли:
# docker run -p 3002:3000 -d notes_app
# где -p 3002:3000 - присоединение локального порта к порту контейнера
# -d - режим независимости консоли от приложения (deattached). Без него включен режим attached, который связывает консоль с контейнером
# notes_app - тег контейнера
#
#
#
#
#